#### ViewDisplayDepthCueing Members

---

|  |
| --- |
| ViewDisplayDepthCueing Class   Methods   Properties   See Also |

The  ViewDisplayDepthCueing  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ViewDisplayDepthCueing |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetStartEndPercentages | Sets start and end percentages. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EnableDepthCueing | True to enable depth cueing. False to disable it. |
| Public property | EndPercentage | The end percentage defines where depth cueing ends. Values between 0 and 100. |
| Public property | FadeTo | The fade to defines the maximum fading in per cent. Values between 0 and 100. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | StartPercentage | The start percentage defines where depth cueing starts. Values between 0 and 100. |

# See Also

ViewDisplayDepthCueing Class

Autodesk.Revit.DB Namespace